zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_PBCFG_A_Registers.h
#define SI32_PBCFG_A_CONTROL0_PGDONEF_MASK  0x80000000
#define SI32_PBCFG_A_CONTROL0_PGDONEF_SHIFT  31
// Firmware has written to the PBPGPHASE register, but the Pulse Generator timer
// has not expired.
#define SI32_PBCFG_A_CONTROL0_PGDONEF_NOT_SET_VALUE  0U
#define SI32_PBCFG_A_CONTROL0_PGDONEF_NOT_SET_U32 \
   (SI32_PBCFG_A_CONTROL0_PGDONEF_NOT_SET_VALUE << SI32_PBCFG_A_CONTROL0_PGDONEF_SHIFT)
// The Pulse Generator cycle finished since the last time PBPGPHASE was written.
#define SI32_PBCFG_A_CONTROL0_PGDONEF_SET_VALUE  1U
#define SI32_PBCFG_A_CONTROL0_PGDONEF_SET_U32 \
   (SI32_PBCFG_A_CONTROL0_PGDONEF_SET_VALUE << SI32_PBCFG_A_CONTROL0_PGDONEF_SHIFT)



struct SI32_PBCFG_A_CONTROL1_Struct
{
   union
   {
      struct
      {
         // JTAG Enable
         volatile uint32_t JTAGEN: 1;
         // ETM Enable
         volatile uint32_t ETMEN: 1;
         // SWV Enable
         volatile uint32_t SWVEN: 1;
                  uint32_t reserved0: 5;
         // SPI1 Fixed Port Selection
         volatile uint32_t SPI1SEL: 1;
         // Port Match Interrupt Enable
         volatile uint32_t PMATCHEN: 1;
                  uint32_t reserved1: 2;
         // Low Power Timer Output Pin Select
         volatile uint32_t LPTOSEL: 1;
                  uint32_t reserved2: 18;
         // Port Bank Configuration Lock
         volatile uint32_t LOCK: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBCFG_A_CONTROL1_JTAGEN_MASK  0x00000001
#define SI32_PBCFG_A_CONTROL1_JTAGEN_SHIFT  0
// JTAG functionality is not pinned out.
#define SI32_PBCFG_A_CONTROL1_JTAGEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_CONTROL1_JTAGEN_DISABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_JTAGEN_DISABLED_VALUE << SI32_PBCFG_A_CONTROL1_JTAGEN_SHIFT)
// JTAG functionality is pinned out.
#define SI32_PBCFG_A_CONTROL1_JTAGEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_CONTROL1_JTAGEN_ENABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_JTAGEN_ENABLED_VALUE << SI32_PBCFG_A_CONTROL1_JTAGEN_SHIFT)

#define SI32_PBCFG_A_CONTROL1_ETMEN_MASK  0x00000002
#define SI32_PBCFG_A_CONTROL1_ETMEN_SHIFT  1
// ETM not pinned out.
#define SI32_PBCFG_A_CONTROL1_ETMEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_CONTROL1_ETMEN_DISABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_ETMEN_DISABLED_VALUE << SI32_PBCFG_A_CONTROL1_ETMEN_SHIFT)
// ETM is enabled and pinned out.
#define SI32_PBCFG_A_CONTROL1_ETMEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_CONTROL1_ETMEN_ENABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_ETMEN_ENABLED_VALUE << SI32_PBCFG_A_CONTROL1_ETMEN_SHIFT)

#define SI32_PBCFG_A_CONTROL1_SWVEN_MASK  0x00000004
#define SI32_PBCFG_A_CONTROL1_SWVEN_SHIFT  2
// SWV is not pinned out.
#define SI32_PBCFG_A_CONTROL1_SWVEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_CONTROL1_SWVEN_DISABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_SWVEN_DISABLED_VALUE << SI32_PBCFG_A_CONTROL1_SWVEN_SHIFT)
// SWV is enabled and pinned out.
#define SI32_PBCFG_A_CONTROL1_SWVEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_CONTROL1_SWVEN_ENABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_SWVEN_ENABLED_VALUE << SI32_PBCFG_A_CONTROL1_SWVEN_SHIFT)

#define SI32_PBCFG_A_CONTROL1_SPI1SEL_MASK  0x00000100
#define SI32_PBCFG_A_CONTROL1_SPI1SEL_SHIFT  8
// Disconnect SPI1 from the dedicated pins.
#define SI32_PBCFG_A_CONTROL1_SPI1SEL_DISABLED_VALUE  0
#define SI32_PBCFG_A_CONTROL1_SPI1SEL_DISABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_SPI1SEL_DISABLED_VALUE << SI32_PBCFG_A_CONTROL1_SPI1SEL_SHIFT)
// Connect SPI1 to the dedicated pins.
#define SI32_PBCFG_A_CONTROL1_SPI1SEL_ENABLED_VALUE  1
#define SI32_PBCFG_A_CONTROL1_SPI1SEL_ENABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_SPI1SEL_ENABLED_VALUE << SI32_PBCFG_A_CONTROL1_SPI1SEL_SHIFT)

#define SI32_PBCFG_A_CONTROL1_PMATCHEN_MASK  0x00000200
#define SI32_PBCFG_A_CONTROL1_PMATCHEN_SHIFT  9
// Disable the port match logic. The PBnMAT registers are not read/write accessible
// on the APB bus.
#define SI32_PBCFG_A_CONTROL1_PMATCHEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_CONTROL1_PMATCHEN_DISABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_PMATCHEN_DISABLED_VALUE << SI32_PBCFG_A_CONTROL1_PMATCHEN_SHIFT)
// Enable the port match logic to generate a port match interrupt. The PBnMAT
// registers are read/write accessible on the APB bus.
#define SI32_PBCFG_A_CONTROL1_PMATCHEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_CONTROL1_PMATCHEN_ENABLED_U32 \
   (SI32_PBCFG_A_CONTROL1_PMATCHEN_ENABLED_VALUE << SI32_PBCFG_A_CONTROL1_PMATCHEN_SHIFT)

#define SI32_PBCFG_A_CONTROL1_LPTOSEL_MASK  0x00001000
#define SI32_PBCFG_A_CONTROL1_LPTOSEL_SHIFT  12
// Route the Low Power Timer output to LPT0OUT0.
#define SI32_PBCFG_A_CONTROL1_LPTOSEL_LPT0OUT0_VALUE  0
#define SI32_PBCFG_A_CONTROL1_LPTOSEL_LPT0OUT0_U32 \
   (SI32_PBCFG_A_CONTROL1_LPTOSEL_LPT0OUT0_VALUE << SI32_PBCFG_A_CONTROL1_LPTOSEL_SHIFT)
// Route the Low Power Timer output to LPT0OUT1.
#define SI32_PBCFG_A_CONTROL1_LPTOSEL_LPT0OUT1_VALUE  1
#define SI32_PBCFG_A_CONTROL1_LPTOSEL_LPT0OUT1_U32 \
   (SI32_PBCFG_A_CONTROL1_LPTOSEL_LPT0OUT1_VALUE << SI32_PBCFG_A_CONTROL1_LPTOSEL_SHIFT)

#define SI32_PBCFG_A_CONTROL1_LOCK_MASK  0x80000000
#define SI32_PBCFG_A_CONTROL1_LOCK_SHIFT  31
// Port Bank Configuration and Control registers are unlocked.
#define SI32_PBCFG_A_CONTROL1_LOCK_UNLOCKED_VALUE  0U
#define SI32_PBCFG_A_CONTROL1_LOCK_UNLOCKED_U32 \
   (SI32_PBCFG_A_CONTROL1_LOCK_UNLOCKED_VALUE << SI32_PBCFG_A_CONTROL1_LOCK_SHIFT)
// The following registers are locked from write access: CONTROL1, XBAR0, and all
// PBSKIP registers.
#define SI32_PBCFG_A_CONTROL1_LOCK_LOCKED_VALUE  1U
#define SI32_PBCFG_A_CONTROL1_LOCK_LOCKED_U32 \
   (SI32_PBCFG_A_CONTROL1_LOCK_LOCKED_VALUE << SI32_PBCFG_A_CONTROL1_LOCK_SHIFT)



struct SI32_PBCFG_A_XBAR0_Struct
{
   union
   {
      struct
      {
         // USART0 Enable
         volatile uint32_t USART0EN: 1;
         // USART0 Flow Control Enable
         volatile uint32_t USART0FCEN: 1;
         // USART0 Clock Signal Enable
         volatile uint32_t USART0CEN: 1;
         // DMA Trigger 0 Enable
         volatile uint32_t DMA0T0EN: 1;
         // DMA Trigger 1 Enabled
         volatile uint32_t DMA0T1EN: 1;
         // IDAC0 Trigger Enable
         volatile uint32_t IDAC0TEN: 1;
         // SPI0 Enable
         volatile uint32_t SPI0EN: 1;
         // SPI0 NSS Pin Enable
         volatile uint32_t SPI0NSSEN: 1;
         // EPCA0 Channel Enable
         volatile uint32_t EPCA0EN: 3;
         // EPCA0 ECI Enable
         volatile uint32_t EECI0EN: 1;
         // I2C0 Enable
         volatile uint32_t I2C0EN: 1;
         // Comparator 0 Synchronous Output (CMP0S) Enable
         volatile uint32_t CMP0SEN: 1;
         // Comparator 0 Asynchronous Output (CMP0A) Enable
         volatile uint32_t CMP0AEN: 1;
         // Comparator 1 Synchronous Output (CMP1S) Enable
         volatile uint32_t CMP1SEN: 1;
         // Comparator 1 Asynchronous Output (CMP1A) Enable
         volatile uint32_t CMP1AEN: 1;
         // TIMER0 T0CT Enable
         volatile uint32_t TMR0CTEN: 1;
         // TIMER0 T0EX Enable
         volatile uint32_t TMR0EXEN: 1;
         // TIMER1 T1CT Enable
         volatile uint32_t TMR1CTEN: 1;
         // TIMER1 T1EX Enable
         volatile uint32_t TMR1EXEN: 1;
         // SARADC0 Trigger Enable
         volatile uint32_t SARADC0TEN: 1;
         // AHB Clock Output Enable
         volatile uint32_t AHBEN: 1;
                  uint32_t reserved0: 8;
         // Crossbar 0 Enable
         volatile uint32_t XBAR0EN: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBCFG_A_XBAR0_USART0EN_MASK  0x00000001
#define SI32_PBCFG_A_XBAR0_USART0EN_SHIFT  0
// Disable USART0 RX and TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_USART0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_USART0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_USART0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_USART0EN_SHIFT)
// Enable USART0 RX and TX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_USART0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_USART0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_USART0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_USART0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0_USART0FCEN_MASK  0x00000002
#define SI32_PBCFG_A_XBAR0_USART0FCEN_SHIFT  1
// Disable USART0 flow control on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_USART0FCEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_USART0FCEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_USART0FCEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_USART0FCEN_SHIFT)
// Enable USART0 flow control on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_USART0FCEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_USART0FCEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_USART0FCEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_USART0FCEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_USART0CEN_MASK  0x00000004
#define SI32_PBCFG_A_XBAR0_USART0CEN_SHIFT  2
// Disable USART0 clock on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_USART0CEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_USART0CEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_USART0CEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_USART0CEN_SHIFT)
// Enable USART0 clock on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_USART0CEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_USART0CEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_USART0CEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_USART0CEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_DMA0T0EN_MASK  0x00000008
#define SI32_PBCFG_A_XBAR0_DMA0T0EN_SHIFT  3
// Disable the DMA trigger 0 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_DMA0T0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_DMA0T0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_DMA0T0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_DMA0T0EN_SHIFT)
// Enable the DMA trigger 0 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_DMA0T0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_DMA0T0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_DMA0T0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_DMA0T0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0_DMA0T1EN_MASK  0x00000010
#define SI32_PBCFG_A_XBAR0_DMA0T1EN_SHIFT  4
// Disable the DMA trigger 1 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_DMA0T1EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_DMA0T1EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_DMA0T1EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_DMA0T1EN_SHIFT)
// Enable the DMA trigger 1 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_DMA0T1EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_DMA0T1EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_DMA0T1EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_DMA0T1EN_SHIFT)

#define SI32_PBCFG_A_XBAR0_IDAC0TEN_MASK  0x00000020
#define SI32_PBCFG_A_XBAR0_IDAC0TEN_SHIFT  5
// Disable the IDAC0 trigger on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_IDAC0TEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_IDAC0TEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_IDAC0TEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_IDAC0TEN_SHIFT)
// Enable the IDAC0 trigger on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_IDAC0TEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_IDAC0TEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_IDAC0TEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_IDAC0TEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_SPI0EN_MASK  0x00000040
#define SI32_PBCFG_A_XBAR0_SPI0EN_SHIFT  6
// Disable SPI0 SCK, MISO, and MOSI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_SPI0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_SPI0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_SPI0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_SPI0EN_SHIFT)
// Enable SPI0 SCK, MISO, and MOSI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_SPI0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_SPI0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_SPI0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_SPI0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0_SPI0NSSEN_MASK  0x00000080
#define SI32_PBCFG_A_XBAR0_SPI0NSSEN_SHIFT  7
// Disable SPI0 NSS on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_SPI0NSSEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_SPI0NSSEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_SPI0NSSEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_SPI0NSSEN_SHIFT)
// Enable SPI0 NSS on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_SPI0NSSEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_SPI0NSSEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_SPI0NSSEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_SPI0NSSEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_EPCA0EN_MASK  0x00000700
#define SI32_PBCFG_A_XBAR0_EPCA0EN_SHIFT  8
// Disable all EPCA0 channels on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_EPCA0EN_NONE_VALUE  0
#define SI32_PBCFG_A_XBAR0_EPCA0EN_NONE_U32 \
   (SI32_PBCFG_A_XBAR0_EPCA0EN_NONE_VALUE << SI32_PBCFG_A_XBAR0_EPCA0EN_SHIFT)
// Enable EPCA0 CEX0 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_0_VALUE  1
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_0_U32 \
   (SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_0_VALUE << SI32_PBCFG_A_XBAR0_EPCA0EN_SHIFT)
// Enable EPCA0 CEX0 and CEX1 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_1_VALUE  2
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_1_U32 \
   (SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_1_VALUE << SI32_PBCFG_A_XBAR0_EPCA0EN_SHIFT)
// Enable EPCA0 CEX0, CEX1, and CEX2 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_2_VALUE  3
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_2_U32 \
   (SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_2_VALUE << SI32_PBCFG_A_XBAR0_EPCA0EN_SHIFT)
// Enable EPCA0 CEX0, CEX1, CEX2, and CEX3 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_3_VALUE  4
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_3_U32 \
   (SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_3_VALUE << SI32_PBCFG_A_XBAR0_EPCA0EN_SHIFT)
// Enable EPCA0 CEX0, CEX1, CEX2, CEX3, and CEX4 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_4_VALUE  5
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_4_U32 \
   (SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_4_VALUE << SI32_PBCFG_A_XBAR0_EPCA0EN_SHIFT)
// Enable EPCA0 CEX0, CEX1, CEX2, CEX3, CEX4, and CEX5 on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_5_VALUE  6
#define SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_5_U32 \
   (SI32_PBCFG_A_XBAR0_EPCA0EN_CEX0_5_VALUE << SI32_PBCFG_A_XBAR0_EPCA0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0_EECI0EN_MASK  0x00000800
#define SI32_PBCFG_A_XBAR0_EECI0EN_SHIFT  11
// Disable EPCA0 ECI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_EECI0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_EECI0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_EECI0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_EECI0EN_SHIFT)
// Enable EPCA0 ECI on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_EECI0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_EECI0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_EECI0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_EECI0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0_I2C0EN_MASK  0x00001000
#define SI32_PBCFG_A_XBAR0_I2C0EN_SHIFT  12
// Disable I2C0 SDA and SCL on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_I2C0EN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_I2C0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_I2C0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_I2C0EN_SHIFT)
// Enable I2C0 SDA and SCL on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_I2C0EN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_I2C0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_I2C0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_I2C0EN_SHIFT)

#define SI32_PBCFG_A_XBAR0_CMP0SEN_MASK  0x00002000
#define SI32_PBCFG_A_XBAR0_CMP0SEN_SHIFT  13
// Disable Comparator 0 Synchronous Output (CMP0S) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_CMP0SEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_CMP0SEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_CMP0SEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_CMP0SEN_SHIFT)
// Enable Comparator 0 Synchronous Output (CMP0S) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_CMP0SEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_CMP0SEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_CMP0SEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_CMP0SEN_SHIFT)

