zephyrproject-rtos/hal_silabs/si32/si32Hal/sim3l1xx/SI32_SIM3L1XX_PBCFG_A_Registers.h
#define SI32_PBCFG_A_XBAR0_CMP0AEN_MASK  0x00004000
#define SI32_PBCFG_A_XBAR0_CMP0AEN_SHIFT  14
// Disable Comparator 0 Asynchronous Output (CMP0A) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_CMP0AEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_CMP0AEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_CMP0AEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_CMP0AEN_SHIFT)
// Enable Comparator 0 Asynchronous Output (CMP0A) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_CMP0AEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_CMP0AEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_CMP0AEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_CMP0AEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_CMP1SEN_MASK  0x00008000
#define SI32_PBCFG_A_XBAR0_CMP1SEN_SHIFT  15
// Disable Comparator 1 Synchronous Output (CMP1S) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_CMP1SEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_CMP1SEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_CMP1SEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_CMP1SEN_SHIFT)
// Enable Comparator 1 Synchronous Output (CMP1S) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_CMP1SEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_CMP1SEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_CMP1SEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_CMP1SEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_CMP1AEN_MASK  0x00010000
#define SI32_PBCFG_A_XBAR0_CMP1AEN_SHIFT  16
// Disable Comparator 1 Asynchronous Output (CMP1A) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_CMP1AEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_CMP1AEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_CMP1AEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_CMP1AEN_SHIFT)
// Enable Comparator 1 Asynchronous Output (CMP1A) on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_CMP1AEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_CMP1AEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_CMP1AEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_CMP1AEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_TMR0CTEN_MASK  0x00020000
#define SI32_PBCFG_A_XBAR0_TMR0CTEN_SHIFT  17
// Disable TIMER0 CT on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_TMR0CTEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_TMR0CTEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_TMR0CTEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_TMR0CTEN_SHIFT)
// Enable TIMER0 CT on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_TMR0CTEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_TMR0CTEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_TMR0CTEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_TMR0CTEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_TMR0EXEN_MASK  0x00040000
#define SI32_PBCFG_A_XBAR0_TMR0EXEN_SHIFT  18
// Disable TIMER0 EX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_TMR0EXEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_TMR0EXEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_TMR0EXEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_TMR0EXEN_SHIFT)
// Enable TIMER0 EX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_TMR0EXEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_TMR0EXEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_TMR0EXEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_TMR0EXEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_TMR1CTEN_MASK  0x00080000
#define SI32_PBCFG_A_XBAR0_TMR1CTEN_SHIFT  19
// Disable TIMER1 CT on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_TMR1CTEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_TMR1CTEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_TMR1CTEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_TMR1CTEN_SHIFT)
// Enable TIMER1 CT on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_TMR1CTEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_TMR1CTEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_TMR1CTEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_TMR1CTEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_TMR1EXEN_MASK  0x00100000
#define SI32_PBCFG_A_XBAR0_TMR1EXEN_SHIFT  20
// Disable TIMER1 EX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_TMR1EXEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_TMR1EXEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_TMR1EXEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_TMR1EXEN_SHIFT)
// Enable TIMER1 EX on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_TMR1EXEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_TMR1EXEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_TMR1EXEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_TMR1EXEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_SARADC0TEN_MASK  0x00200000
#define SI32_PBCFG_A_XBAR0_SARADC0TEN_SHIFT  21
// Disable SARADC0 conversion start trigger on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_SARADC0TEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_SARADC0TEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_SARADC0TEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_SARADC0TEN_SHIFT)
// Enable SARADC0 conversion start trigger on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_SARADC0TEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_SARADC0TEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_SARADC0TEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_SARADC0TEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_AHBEN_MASK  0x00400000
#define SI32_PBCFG_A_XBAR0_AHBEN_SHIFT  22
// Disable the AHB Clock / 16 output on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_AHBEN_DISABLED_VALUE  0
#define SI32_PBCFG_A_XBAR0_AHBEN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_AHBEN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_AHBEN_SHIFT)
// Enable the AHB Clock / 16 output on Crossbar 0.
#define SI32_PBCFG_A_XBAR0_AHBEN_ENABLED_VALUE  1
#define SI32_PBCFG_A_XBAR0_AHBEN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_AHBEN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_AHBEN_SHIFT)

#define SI32_PBCFG_A_XBAR0_XBAR0EN_MASK  0x80000000
#define SI32_PBCFG_A_XBAR0_XBAR0EN_SHIFT  31
// Disable Crossbar 0.
#define SI32_PBCFG_A_XBAR0_XBAR0EN_DISABLED_VALUE  0U
#define SI32_PBCFG_A_XBAR0_XBAR0EN_DISABLED_U32 \
   (SI32_PBCFG_A_XBAR0_XBAR0EN_DISABLED_VALUE << SI32_PBCFG_A_XBAR0_XBAR0EN_SHIFT)
// Enable Crossbar 0.
#define SI32_PBCFG_A_XBAR0_XBAR0EN_ENABLED_VALUE  1U
#define SI32_PBCFG_A_XBAR0_XBAR0EN_ENABLED_U32 \
   (SI32_PBCFG_A_XBAR0_XBAR0EN_ENABLED_VALUE << SI32_PBCFG_A_XBAR0_XBAR0EN_SHIFT)



struct SI32_PBCFG_A_PBKEY_Struct
{
   union
   {
      struct
      {
         // Port Bank Key
         volatile uint8_t KEY;
                  uint32_t reserved0: 24;
      };
      volatile uint32_t U32;
   };
};

#define SI32_PBCFG_A_PBKEY_KEY_MASK  0x000000FF
#define SI32_PBCFG_A_PBKEY_KEY_SHIFT  0
// Port Bank registers are locked and no valid values have been written to PBKEY.
#define SI32_PBCFG_A_PBKEY_KEY_LOCKED_VALUE  0
#define SI32_PBCFG_A_PBKEY_KEY_LOCKED_U32 \
   (SI32_PBCFG_A_PBKEY_KEY_LOCKED_VALUE << SI32_PBCFG_A_PBKEY_KEY_SHIFT)
// Port Bank registers are locked and the first valid value (0xA5) has been written
// to PBKEY.
#define SI32_PBCFG_A_PBKEY_KEY_INTERMEDIATE_VALUE  1
#define SI32_PBCFG_A_PBKEY_KEY_INTERMEDIATE_U32 \
   (SI32_PBCFG_A_PBKEY_KEY_INTERMEDIATE_VALUE << SI32_PBCFG_A_PBKEY_KEY_SHIFT)
// Port Bank registers are unlocked. Any subsequent writes to the Port Bank
// registers or PBKEY will lock the interface.
#define SI32_PBCFG_A_PBKEY_KEY_UNLOCKED_VALUE  2
#define SI32_PBCFG_A_PBKEY_KEY_UNLOCKED_U32 \
   (SI32_PBCFG_A_PBKEY_KEY_UNLOCKED_VALUE << SI32_PBCFG_A_PBKEY_KEY_SHIFT)



typedef struct SI32_PBCFG_A_Struct
{
   struct SI32_PBCFG_A_CONTROL0_Struct             CONTROL0       ; // Base Address + 0x0
   volatile uint32_t                               CONTROL0_SET;
   volatile uint32_t                               CONTROL0_CLR;
   uint32_t                                        reserved0;
   struct SI32_PBCFG_A_CONTROL1_Struct             CONTROL1       ; // Base Address + 0x10
   volatile uint32_t                               CONTROL1_SET;
   volatile uint32_t                               CONTROL1_CLR;
   uint32_t                                        reserved1;
   struct SI32_PBCFG_A_XBAR0_Struct                XBAR0          ; // Base Address + 0x20
   volatile uint32_t                               XBAR0_SET;
   volatile uint32_t                               XBAR0_CLR;
   uint32_t                                        reserved2;
   struct SI32_PBCFG_A_PBKEY_Struct                PBKEY          ; // Base Address + 0x30
   uint32_t                                        reserved3;
   uint32_t                                        reserved4;
   uint32_t                                        reserved5;
} SI32_PBCFG_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_PBCFG_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

